
/*-------------------------------------------------------------
    C语言描述的显示支持例程

    修改时间列表:
    2011-01-05 23:51:21 
    2011-01-07 22:02:44 
-------------------------------------------------------------*/


#include    "ke.h"




/*-------------------------------------------------
    把一个整数转换成字符串形式，数字前的0不被显示出来

    输入参数：
      str:  批向输出字串缓冲区，这个缓冲区由调用者提供
      num:  要转换的整数

    输出：
        转换后字串的指针，即第一个参数
-------------------------------------------------*/

pchar
_stdcall
itoa(
    pchar   str,
    long    num
    )
{
    pchar   p = str;
    char    ch;
    int     i;
    int     flag = 0;   // 指示从大于0的最高那一位开始设置

    *p++ = '0';
    *p++ = 'x';

    if (num == 0)
    {
        *p++ ='0';
    }
    else
    {
        for (i = 32 - 4; i >= 0; i -= 4)
        {
            ch = (num >> i) & 0xf;

            if (flag || (ch > 0))
            {
                flag = 1;
                ch += '0';

                if (ch > '9')
                    ch += 0x27;     // 'a' - '9' - 1

                *p++ = ch;
            }
        }
    }

    *p = 0;

    return str;
}
/*-----------------------------------------------*/



/*-------------------------------------------------
    显示一个串和一个整数,用于输出一个变量(名称和值)
-------------------------------------------------*/

void
_stdcall
print_var(
    char*   var_name,
    ulong   var_value
    )
{
    DisplayReturn();
    DisplayString(var_name);
    DisplayInt(var_value);
}
/*-----------------------------------------------*/



/*-------------------------------------------------
    C描述的显示整数函数

    输入：
        将要显示的整数
-------------------------------------------------*/

void
_stdcall
PrintInt(long num)
{
    char    outputstr[16];

    itoa(outputstr, num);
    DisplayString(outputstr);
}

/*-----------------------------------------------*/




